#------------------------------
print("1a.")
print("Hello World I am using Python.")
print("\n")
#------------------------------
print("2a.")
print("Язык программирования \"Python\"")
print("\n")
#------------------------------
print("3a.")
print("Я услышала стук в дверь:\n— Зачем вы явились?\nБорис ответил:\n— Принес посылку.")
print("\n")
#------------------------------

#------------------------------
print("1b.")
print("*\n**\n***\n****\n*****")
print("\n")
#------------------------------
print("2b.")
print("Python" + "great" + "programming" + "language")
print("\n")
#------------------------------

#------------------------------
print("1c.")
P = chr(80)
Y = chr(89)
T = chr(84)
H = chr(72)
O = chr(79)
N = chr(78)
print(P + "\n" + Y + "\n" + T + "\n" + H + "\n" + O + "\n" + N)
print("\n")
#------------------------------
print("2c.")
a = 27
b = 8
c = 255
d = 4
e = 2
print(a % b)
print(int(255 / 4))
print(2**5)
print("\n")
#------------------------------