import math

#------------------------------
print("1a.")
print("Im learning \"Python\"")
print("\n")
#------------------------------
print("2a.")
print("Decode\nis\nCool.")
print("\n")
#------------------------------
print("3a.")
print("Кодинг." * 4)
print("\n")
#------------------------------




#------------------------------
print("1b.")

D = chr(68)
E = chr(69)
C = chr(67)
O = chr(79)

print(D + "\n" + E + "\n" + C + "\n" + O + "\n" + D + "\n" + E)
print("\n")
#------------------------------
print("2b.")
c = 23
d = 4
e = 5
print((c % d) * e)
print("\n")
#------------------------------




#------------------------------
print("1c.")

a = 5
b = 12

c = math.sqrt(a * a + b * b)
print(c)
print("\n")
#------------------------------
print("2c.")
print("Ложкой снег мешая,\nHочь идет большая,\nЧто же ты, глупышка, не спишь?\nСпят твои соседи,Белые медведи,\nСпи и ты скорей, малыш.")
print("\n")
#------------------------------